api/app/controllers/users_controller.rb

    def login

        sql = "userrname = :username OR email = :email"

        user = User.where(sql, { username: user_params[:username],email: user_params[:email] }).first
---
SELECT "users".* FROM "users" WHERE (userrname = 'kimkim' OR email = NULL) ORDER BY "users"."id" ASC LIMIT ?  [["LIMIT", 1]]